fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CommonModules/ВКМ_МассовоеСозданиеРеализаций/Module.bsl
#Область СлужебныеПроцедурыИФункции 

Функция ЗаполнениеТабличнойЧастиМассовогоСозданияАктов(Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Владелец КАК Владелец,
	|	ДоговорыКонтрагентов.Организация КАК Организация
	|ПОМЕСТИТЬ ВТ_ДоговораАО
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Реализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	МЕСЯЦ(РеализацияТоваровУслуг.Дата) = МЕСЯЦ(&Период)
	|	И ГОД(РеализацияТоваровУслуг.Дата) = ГОД(&Период)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДоговораАО.Ссылка КАК Договор,
	|	ВТ_ДоговораАО.Владелец КАК Контрагент,
	|	ВТ_ДоговораАО.Организация КАК Организация,
	|	ВТ_Реализации.Ссылка КАК Реализация
	|ИЗ
	|	ВТ_ДоговораАО КАК ВТ_ДоговораАО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Реализации КАК ВТ_Реализации
	|		ПО ВТ_ДоговораАО.Ссылка = ВТ_Реализации.Ссылка.Договор
	|ГДЕ
	|	ВТ_Реализации.Ссылка ЕСТЬ NULL";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживание);
	Запрос.УстановитьПараметр("Период", Период);
	
	НашлиДокументы = Запрос.Выполнить().Выгрузить();
	
	МассивСозданныхДокументов = Новый Массив;
	
	Для Каждого Строка из НашлиДокументы Цикл
	
		НовыйДокументРеализации = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
        НовыйДокументРеализации.Дата = КонецМесяца(Период);
		НовыйДокументРеализации.Ответственный = Пользователи.ТекущийПользователь();
		НовыйДокументРеализации.Договор = Строка.Договор;
		НовыйДокументРеализации.Контрагент = Строка.Контрагент;
		НовыйДокументРеализации.Организация = Строка.Организация;
		НовыйДокументРеализации.ВКМ_ВыполнитьАвтозаполнение();
		НовыйДокументРеализации.Основание = Документы.ЗаказПокупателя.ПустаяСсылка();
		
		Если НовыйДокументРеализации.ПроверитьЗаполнение() Тогда 
			НовыйДокументРеализации.Записать(РежимЗаписиДокумента.Проведение);
			СтрокаОбработки = Новый Структура;
			СтрокаОбработки.Вставить("Договор", Строка.Договор);
			СтрокаОбработки.Вставить("ДокументРеализации", НовыйДокументРеализации.Ссылка);
			МассивСозданныхДокументов.Добавить(СтрокаОбработки);
		КонецЕсли;
			
	КонецЦикла;

Возврат МассивСозданныхДокументов;

КонецФункции

#КонецОбласти
